/*
2019/05/19 10:31:42
結構體數組.c
*/

#include<stdio.h>
#include<stdlib.h>

struct Info {
	char email[100];
	char name[30];
	char addr[100];
	char unused_num[100];
}csdndata[] =
{
{"huxia82475@sina.com", "梁聖文", "定西路788號凱陽大廈8A無尚會館", "131,3,61270663,13636574806,38.90"},
{"chen_3001@163.com","陳虹清","洪溪鎮工業區億發泡塑製造有限公司","133,1903,057384957068,15005837995,16.00"},
{"yjbaqkhh520@163.com","劉陳鍾","北京市海澱區西三旗建材城西路85號院內甲7號樓2單元101室","111,1,01062843144,13426035611,48.40"},
{"chengang22@hotmail.com","陳鋼","城中路76號501室","131,3,69910997,13817855355,7.80"},
{"kickfox@163.com","盛俊伶","奧林花園B區71號401","132,1607,,13915280806,48.00"},
{"6588204@163.com","劉建華","興安北路","115,1001,6588204,13804745796,73.00"},
{"617291043@qq.com","林小燕","園山南路798號　善源堂藥店","135,2105,5558342,13959222580,48.40"},
{"565495805@qq.com","黃楚琪","洛浦街洛濤南區二棟之五403","144,5,84540278,15989226861,21.30"}
}, * csdnp;
void mainData() {
	csdnp = (struct Info[]){
		{"huxia82475@sina.com", "梁聖文", "定西路788號凱陽大廈8A無尚會館", "131,3,61270663,13636574806,38.90"},
		{ "chen_3001@163.com","陳虹清","洪溪鎮工業區億發泡塑製造有限公司","133,1903,057384957068,15005837995,16.00" },
		{ "yjbaqkhh520@163.com","劉陳鍾","北京市海澱區西三旗建材城西路85號院內甲7號樓2單元101室","111,1,01062843144,13426035611,48.40" },
		{ "chengang22@hotmail.com","陳鋼","城中路76號501室","131,3,69910997,13817855355,7.80" },
		{ "kickfox@163.com","盛俊伶","奧林花園B區71號401","132,1607,,13915280806,48.00" },
		{ "6588204@163.com","劉建華","興安北路","115,1001,6588204,13804745796,73.00" },
		{ "617291043@qq.com","林小燕","園山南路798號　善源堂藥店","135,2105,5558342,13959222580,48.40" },
		{ "565495805@qq.com","黃楚琪","洛浦街洛濤南區二棟之五403","144,5,84540278,15989226861,21.30" }
	};
	printf("%s\n%s\n%s\n", (csdnp + 0)->email, (csdnp + 0)->name, (csdnp + 0)->addr);
	printf("%s\n%s\n%s\n", (*(csdnp + 1)).email, (*(csdnp + 1)).name,(*(csdnp + 1)).addr);
//	printf("%s\n%s\n%s\n", (*(csdndata + 0)).addr, (*(csdndata + 0)).email, (*(csdndata + 0)).addr);

	system("pause");
}